[
    {
        "title":"จอภาพ (Monitor)",
        "subtitle":"จอภาพเป็นอุปกรณ์ที่มีหน้าที่แสดงผลลัพธ์การประมวลผล",
        "image_url":"https://cdn.pixabay.com/photo/2012/04/13/17/00/lcd-32872_960_720.png",
        "detail":"เป็นอุปกรณ์แสดงผลที่มีความสำคัญมากที่สุด เพราะจะต้องใช้ในการมองเห็นของผู้ใช้ เวลาใช้งานคอมพิวเตอร์ โดยจอภาพที่นิยมก็คือ จอแอลซีดี (LCD : Liquid Crystal Display) ซึ่งมี ลักษณะแบนราบ มี ขนาดเล็กและบาง การทำงานนั้นอาศัยหลักของการใช้ความร้อนที่ได้จากขดลวด มาทำการเปลี่ยนและ บังคับให้ผลึกเหลวแสดงสีต่างๆ ออกมาตามที่ต้องการซึ่งการแสดงสีนั้นจะเป็นไปตามที่กำหนด"

    },
    {
        "title":"เคส (Case)",
        "subtitle":"หลาย คนเรียกว่า CPU แต่ที่จริงแล้วมันเรียกว่า เคส",
        "image_url":"https://cdn.pixabay.com/photo/2013/07/12/15/57/server-150619_960_720.png",
        "detail":"  เคสหมายถึง กล่องที่เก็บอุปกรณ์ของคอมพิวเตอร์ข้างในไม่ได้หมายถึง คอมทั้งเครื่องนั่นเอง โดยหน้าที่หลักๆของเคสจะเป็นการจัดเก็บรวบอุปกรณ์ของคอมพิวเตอร์ให้อยู่ข้างในนั้นไม่ว่าจะเป็น Mainboard Ram VGA Powersupply ไปจนถึงอื่นๆนั่นเอง และ อีกหน้าที่หลักๆ คือ ป้องกันอันตรายที่อาจเกิดจากทั้งตัวอุปกรณ์เอง ไม่ว่าจะเป็น ไฟช็อต ไฟดูด ไฟฟ้าลัดวงจร ไปจนถึง ป้องกันอันตรายจากข้างนอกมาใส่อุปกรณ์เช่นของตกใส่เป็นต้น"

    },
    {
        "title":"พาวเวอร์ซัพพลาย (Power Supply)",
        "subtitle":"เป็นอุปกรณ์ที่ทำหน้าที่ในการจ่ายกระแสไฟฟ้าให้กับชิ้นส่วนอุปกรณ์คอมพิวเตอร์",
        "image_url":"https://cdn.pixabay.com/photo/2018/05/20/11/01/computer-3415505_960_720.jpg",
        "detail":" แหล่งจ่ายไฟหรือที่มักจะเรียกทับศัพท์ว่าเพาว์เวอร์ซัพพลาย เป็นส่วนประกอบที่สำคัญส่วนหนึ่งทำหน้าที่แปลงสัญญาณ ไฟฟ้ากระแสสลับจากแหล่งกำเนิดให้เป็นไฟฟ้ากระแสตรงด้วยความต่างศักย์ที่เหมาะสมก่อนเข้าสู่คอมพิวเตอร์ โดยมีสายเชื่อมต่อไปยังอุปกรณ์ประกอบต่าง ๆ ภายในเครื่อง ซึ่งในการแปลงสัญญาณไฟฟ้าดังกล่าวนี้จะก่อให้เกิดความร้อนขึ้นด้วย ดังนั้นภายในแหล่งจ่ายไฟจึงต้องมีพัดลมเพื่อช่วยในการระบายความร้อนออกจากตัวเครื่องซึ่งมีความสำคัญมาก เพราะการที่เครื่องมีความร้อนที่สูงมาก ๆ นั้น อาจจะเกิดความเสียหายต่ออุปกรณ์ประกอบภายในเครื่องได้ง่าย ปกติแล้วมักจะไม่ค่อยมีการเลือกซื้อพาว์เวอร์ซัพพลายกันนักถ้าไม่ใช่เนื่องจากตัวเก่าที่ใช้อยู่เกิดเสียไปโดยมากเราจะเลือกซื้อ มาพร้อมกับเคส"

    },
    {
        "title":"คีย์บอร์ด (Keyboard)",
        "subtitle":"คีย์บอร์ดเป็นคล้ายแป้นพิมพ์ เพื่อป้อนข้อมูลต่างๆ ลงไปในคอมพิวเตอร์",
        "image_url":"https://cdn.pixabay.com/photo/2015/05/26/23/52/technology-785742_960_720.jpg",
        "detail":"คียบอร์ด หรือ แป้นพิมพ์ (Keybourd) เป็นอุปกรณ์คอมพิวเตอร์ที่ทุกเครื่องจำเป็นต้องมี เป็นอุปกรณ์หลักที่ใช้ในการนำข้อมูลลงในเครื่องคอมพิวเตอร์ โดยปกติมักจะมีลักษณะเป็นสี่เหลี่ยมผืนผ้าหรือใกล้เคียง มีแป้นต่างๆ ประมาณร้อยแป้นอยู่บนคีย์บอร์ด (ขึ้นอยู่กับผังแป้นพิมพ์) ซึ่งถอดแบบมาจากเครื่องพิมพ์ดีด ออกแบบมาเพื่อใช้สำหรับรับข้อมูลที่เป็นตัวอักขระ แล้วทำการเปลี่ยนเป็นรหัส 7 หรือ 8 บิต จากนั้นจึงส่งให้คอมพิวเตอร์ประมวลผล หรือใช้ควบคุมฟังก์ชันการทำงานบางอย่างของคอมพิวเตอร์ และเพื่อให้การป้อนข้อมูลที่เป็นอักขระและตัวเลขทำได้ง่ายและสะดวกขึ้น คีย์บอร์ดจึงแยกแผงที่เป็นแป้นอักขระกับแป้นตัวเลขแยกไว้ต่างหาก"

    },
    {
        "title":"เมนบอร์ด (Main board)",
        "subtitle":"เป็นแผ่นวงจรไฟฟ้าแผ่นใหญ่ที่รวมเอาชิ้นส่วนอิเล็กทรอนิกส์ที่สำคัญไว้ด้วยกัน",
        "image_url":"https://cdn.pixabay.com/photo/2013/03/02/01/25/main-board-89049_960_720.jpg",
        "detail":"แผงวงจรหลัก, แผงหลัก หรือชื่ออื่นเช่น เมนบอร์ด (อังกฤษ: mainboard/main board), มาเธอร์บอร์ด (อังกฤษ: motherboard), ซิสเต็มบอร์ด (อังกฤษ: system board), ลอจิกบอร์ด (อังกฤษ: logic board) เป็นแผงวงจรอิเล็กทรอนิกส์ส่วนสำคัญของคอมพิวเตอร์ แผงวงจรหลักของคอมพิวเตอร์ส่วนบุคคลทั่วไปจะประกอบด้วยซ็อกเก็ตสำหรับบรรจุหน่วยประมวลผลกลางและหน่วยความจำ มีไบออสเป็นเฟิร์มแวร์ พร้อมช่องให้สามารถเชื่อมต่ออุปกรณ์เสริมอื่น ๆ ได้ทั้งอุปกรณ์ติดตั้งภายในและอุปกรณ์เชื่อมต่อภายนอก"

    },
    {
        "title":"ซีพียู (CPU)",
        "subtitle":"ซีพียูหรือหน่วยประมวลผลกลาง เรียกอีกชื่อหนึ่งว่า โปรเซสเซอร์ (Processor) หรือ ชิป (chip)",
        "image_url":"https://cdn.pixabay.com/photo/2014/12/11/22/07/cpu-564771_960_720.jpg",
        "detail":"หน่วยประมวลผลกลางหรือ CPU เป็นฮาร์ดแวร์ชิ้นหนึ่งที่ทำให้คอมพิวเตอร์ของคุณมีปฏิสัมพันธ์กับแอปพลิเคชันและโปรแกรมต่าง ๆ ที่ติดตั้งไว้ CPU จะตีความคำสั่งของโปรแกรมและสร้างผลลัพธ์ตามที่คุณทำใช้งานอินเทอร์เฟซในขณะที่คุณใช้คอมพิวเตอร์โปรเซสเซอร์นั้นประกอบด้วยฮาร์ดแวร์ที่ทำงานร่วมกันเพื่อส่งข้อมูล เพื่อให้คอมพิวเตอร์ของคุณสามารถทำงานให้เสร็จตามที่คุณต้องการได้เมื่อคุณเปิดแอปพลิเคชันหรือเปลี่ยนแปลงแก้ไขไฟล์ ไม่ว่าการประมวลผลจะรวดเร็ว หรือเชื่องช้าจนน่าหงุดหงิด ทั้งหมดนี้ส่งผลต่อประสบการณ์การใช้คอมพิวเตอร์ของคุณได้อย่างมากมายความเร็วประมวลผลคอร์และสัญญาณนาฬิกา ของโปรเซสเซอร์คือตัวบ่งชี้ว่าจะรับข้อมูลได้มากน้อยเพียงใดในคราวหนึ่ง และคอมพิวเตอร์ของคุณจะประมวลผลข้อมูลได้อย่างรวดเร็วเพียงใด ความเร็วที่เป็นผลมาจากการทำงานร่วมกันระหว่างความเร็วประมวลผลคอร์และความเร็วสัญญาณนาฬิกาของคอมพิวเตอร์นั้น ถือว่าเป็นความเร็วในการประมวลผล"

    },
    {
        "title":"การ์ดแสดงผล (Video Card หรือ Display Card)",
        "subtitle":"เป็นอุปกรณ์ที่รับข้อมูลเกี่ยวกับการแสดงผลจากหน่วยความจำ",
        "image_url":"https://cdn.pixabay.com/photo/2017/04/04/17/23/nvidia-2202279_960_720.jpg",
        "detail":"การ์ดแสดงผลใช้สำหรับเก็บข้อมูลที่ได้รับมาจากซีพียู โดยที่การ์ดบางรุ่นสามารถประมวลผลได้ในตัวการ์ด ซึ่งจะช่วยแบ่งเบาภาระการประมวลผลให้ซีพียู จึงทำให้การทำงานของคอมพิวเตอร์นั้นเร็วขึ้นด้วย ซึ่งตัวการ์ดแสดงผลนั้นจะมีหน่วยความจำในตัวของมันเอง ถ้าตัวการ์ดมีหน่วยความจำมาก ก็จะรับข้อมูลจากซีพียูได้มากขึ้น ซึ่งจะช่วยให้การแสดงผลบนจอภาพมีความเร็วสูงขึ้นอีก"

    },
    {
        "title":"แรม (RAM)",
        "subtitle":"RAM หรือ Random-Access Memory เป็นหน่วยความจำหลักแต่ไม่ถาวร ซึ่งจะต้องมีไฟมาหล่อเลี้ยงอุปกรณ์ตลอดในการทำงาน",
        "image_url":"https://cdn.pixabay.com/photo/2012/03/01/01/14/chips-20072_960_720.jpg",
        "detail":"Ram คือหน่วยความจำหลักของคอมพิวเตอร์ เป็นส่วนประกอบสำคัญที่มีผลต่อการทำงานและความเร็วของเครื่องคอมพิวเตอร์ โดยคำว่า Ram ย่อมาจาก Random Access Memory มีหน้าที่ในการรับข้อมูลหรือชุดคำสั่งของโปรแกรมเพื่อส่งต่อไปประมวลผลที่ CPU แรมจัดเป็นหน่วยความจำชั่วคราวโดยการทำงานจะเป็นการเขียนหรือบันทึกข้อมูลแบบสุ่มคือ CPU จะสามารถเข้าถึงทุกๆส่วนของ Ram เพื่อความรวดเร็วในการบันทึกและอ่านข้อมูลจึงเป็นที่มาของคำว่า Random Access แต่เมื่อปิดคอมพิวเตอร์หรือตัดกระแสไฟฟ้า ข้อมูลที่อยู่ใน Ram ก็จะหายไปจนหมด ส่วนประกอบของ Ram ได้แก่ Input Storage Area ,Working Storage Area ,Output Storage Area ,Program Storage Area"

    },
    {
        "title":"ฮาร์ดดิสก์ (Hard disk)",
        "subtitle":"เป็นอุปกรณ์ที่ใช้ในการเก็บข้อมูลในคอมพิวเตอร์",
        "image_url":"https://cdn.pixabay.com/photo/2015/01/22/07/03/hard-drive-607461_960_720.jpg",
        "detail":"Harddisk คืออุปกรณ์คอมพิวเตอร์ที่บรรจุข้อมูล แบบไม่ลบเลือน HDD ย่อมาจาก Hard Disk Drive มีลักษณะเป็นจานโลหะซึ่งจะหมุนอย่างรวดเร็วเมื่อทำงาน เมื่อติดตั้งเข้ากับตัวคอมพิวเตอร์สามารถทำได้ผ่านการต่อเข้ากับเมนบอร์ด อีกทั้งยังสามารถต่อใช่งานจากภายนอกได้ผ่านทางสาย USB ซึ่งทำให้การใช้ฮาร์ดดิสสะดวกยิ่งขึ้นเมื่อไม่ได้ใช้คอมพิวเตอร์ของตนเอง ขนาดของฮาร์ดดิสปัจจุบันนิยมกันอยู่ 2 ขนาดคือ 3.5นิ้ว ที่นิยมใช้ในคอมพิวเตอร์ตั้งโต๊ะทั่วไปและ 2.5นิ้ว ที่จะใช้กับ Notebook ความเร็วในการบันทึกข้อมูลของ Harddisk ใช้หน่วยเป็น RPM (Revolutions Pes Minute) ในปัจจุบันฮาร์ดดิสมีความเร็วในการบันทึกข้อมูลตั้งแต่ 5400RPM ที่เป็นความเร็วมาตรฐานของฮาร์ดดิสทั่วไปจนไปถึง 15,000RPM มีเป็นฮาร์ดดิสความเร็วสูงสำหรับเครื่องเซิร์ฟเวอร์ ความจุของฮาร์ดดิสคือเนื้อที่ในการจัดเก็บข้อมูล ยิ่งมีความจุมากก็ยิ่งบันทึกข้อมูลได้มากยิ่งขึ้น "

    }

]




